nc: 2
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  [[-1, 1, Conv, [16, 3, 2]],
   [-1, 1, Conv, [32, 3, 2]],
   [-1, 1, C2f, [32, 32, 1, True]],
   [-1, 1, Conv, [64, 3, 2]],
   [-1, 2, C2f, [64, 64, 2, True]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 2, C2f, [128, 128, 2, True]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 1, C2f, [256, 256, 1, True]],
   [-1, 1, SPPF, [256, 5]]]

head:
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 1, C2f, [384, 128, 1]],

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 1, C2f, [192, 64, 1]],

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 12], 1, Concat, [1]],
   [-1, 1, C2f, [192, 128, 1]],

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 9], 1, Concat, [1]],
   [-1, 1, C2f, [384, 256, 1]],

   [[7, 10, 13], 1, Segment, [2, 32, 256, [64, 128, 256]]]  # ✅ 정확히 맞는 형식!
  ]
